import DisneySongs2Table from "./DisneySongs2Table.jpg";

function DisneySongs2(): JSX.Element {
  return (
    <div className="Article">
      <h2>טבלת השירים בשירי דיסני, רצון הגיבור</h2>
      <div className="articleBody">
        <p>
          שיר "מה אני רוצה" של הגיבור יגיע תמיד בתחילת הסרט והוא מראה לנו את
          הדמות ברגעי הפתיחה. אחרי שראינו את העולם (או תוך כדי, כמו ב"היפה
          והחיה") אנחנו רוצים לפגוש את נושע המחשב ולשאול את עצמנו מה מטרתו. השיר
          הזה הוא מקום נהדר לשאלת מה העלילה העיקרית של הסרט ואיך הוא בא לקדם את
          הגיבור שלנו.
        </p>
        <p>
          כמעט תמיד רצון הגיבור ישתנה במהלך הסרט. הגיבור נמצא בנקודה אחת ומתקדם
          ממנה, כשתהליך ההתקדמות העיקרי הוא ההבנה מה הוא רוצה ואיך להשיג את
          המטרה (כמובן שאין סופים רעים, אנחנו מדברים על סרטי דיסני. אין מצב
          שהגיבור ירצה משהו ולא יצליח להשיג אותו). בהקשר הזה יצוינו לרעה הרקולס,
          בו הפרוטגוניסט רוצה להיות גיבור מהדקה הראשונה, מצליח להיות גיבור בקלות
          ויוצר סרט לא מאוד מעניין באופן כללי ובת הים הקטנה, שרוצה להיות חלק
          מעולם בני האדם מהקדה הראשונה.
        </p>
        <p>השאר מציגים מקרים קצת יותר מעניינים:</p>
        <p>
          בל (היפה והחיה) – רוצה "משהו מעבר" על פני העיירה הקטנה, אבל לא יודעת
          מה בדיוק היא מחפשת. הסרט כמובן יעזור לה להבין שהיא בסה"כ רוצה בעל.
        </p>
        <p>
          אלאדין – לא מתעניין בשום דבר מלבד הארוחה הבאה. שימו לב שאחרי שהוא
          יפגוש את הנסיכה שלנו נקבל שתי שורות במנגינת השיר שמעידות שמקנן בו רצון
          פנימי למשהו מעבר (להיות נסיך ואישה יפיפייה, כמה מקורי).
        </p>
        <p>
          סימבה (מלך האריות) – רוצה להיות כבר המלך. יתנגש באופן מעניין עם הרצון
          שלו אחרי האקונה מטטה.
        </p>
        <p>
          פוקהונטס – רוצה גם היא "משהו מעבר", חיים מעניינים יותר מהקיבעון הקודם.
        </p>
        <p>
          קווזימודו (הגיבן מנוטרה דאם) – רוצה לראות איך חיים האנשים הרגילים. כל
          השאיפה שלו היא להיות חלק מכולם. שימו לב שבשיר הרצון כאן מופיע גם הנבל
          (השיר היחיד שבו זה קורה), נדבר על זה כשנגיע לחלק הזה בטבלה.
        </p>
        <p>מולאן – רוצה לדעת מי היא ולא לבייש את המשפחה.</p>
        <p>
          לא נגענו כאן בכלל בפן המוזיקלי של השירים (שימו לב לדוגמה שאריאל שרה את
          המוטיב המוזיקלי שלה [1], מולאן באופן מופגן דווקא לא מתקרבת אליו ונקבל
          אותו לראשונה רק בחלק בו היא לובשת מדים [2] ואפשר לכתוב פוסט על כל שיר
          בפני עצמו בכיוון הזה), אבל זה סיפור אחר ויסופר בפעם אחרת.
        </p>
      </div>
      <img src={DisneySongs2Table} className="articleImg" alt="טבלת החלוקה לשירים של דיסני" />
      <ul className="articleReferences">
        <li>
          תקשיבו
          <a href="https://youtu.be/N-9B9x5YCcI?t=232"> לחלק הזה. </a>
          ואז
          <a href="https://www.youtube.com/watch?v=SXKlJuO07eM"> לשיר כולו.</a>
        </li>
        <li>
          <a href="https://youtu.be/1tU5CsJoU60?t=37">הנה הוא </a>
          בקטע בו הוא מופיע לראשונה. באופן כללי אני ממליץ לצפות במולאן
          ולעקוב אחרי מוטיבים מוזיקליים, הסרט מלא בהם.
        </li>
      </ul>
    </div>
  );
}

export default DisneySongs2;
