import Marx_Brothers_1948 from "./Marx_Brothers_1948.jpg";
// import allArticles from "../AllArticles";

function MarxBros(): JSX.Element {
  return (
    <div className="Article">
      <h2>מכתב גראוצ'ו מרקס</h2>
      <div className="articleBody">
        <p>
          בשנת 1942 הוציאו אולפני האחים וורנר (Warner bros.) את אחת הקלאסיקות
          הקלונעיות המצליחות ביותר בהיסטוריה, "קזבלנקה", בכיכובם של אינגריד
          ברגמן והמפרי בוגרט. כשלוש שנים לאחר מכן נודע לאחים וורנר כי האחים מרקס
          (Marx bros), אחים בדרנים מהמפורסמים ביותר בתקופתם, החליטו להוציא סרט
          הומוריסטי שצוחק על סרטם שייקרא "לילות קזבלנקה".
        </p>
        <p>
          אולפני האחים וורנר לא תכננו לתת לתוכנית לעבור בשתיקה ושלחו מכתב משפטי
          מאיים לאחים מרקס המזהיר אותם מהפרת זכויות היוצרים ושימוש במילה
          "קזבלנקה" בכותרת הסרט. כתגובה לאיומם כתב גראוצ'ו מרקס, הידוע באחים,
          מכתב פומבי לאחים וורנר ואף שלח אותו לתקשורת. המכתב מוצלח כל כך שהחלטתי
          לתרגם אותו לעברית במלואו והרי הוא בפניכם (כל הכתוב בסוגרים הוא הוספה
          שלי):
        </p>
        <br />
        <p>האחים וורנר היקרים:</p>
        <p>
          מסתבר שיש יותר מדרך אחת לכבוש עיר ולהחזיק בה כבשלך. לצורך הדוגמה, עד
          לרגע בו תכננו לצלם סרט לא היה לי כל מושג כי העיר קזבלנקה שייכת בלעדית
          לאולפני האחים וורנר.
        </p>
        <p>
          עם זאת, עברו ימים בודדים בלבד מהכרזתנו עד שקיבלנו מכתב משפטי ארוך
          ומאיים המזהיר אותנו לא להשתמש בשם "קזבלנקה".
        </p>
        <p>
          נראה כי ב1471, פרדיננד בלבואה וורנר, סב־סבם של הארי וג'ק (שמותיהם
          הפרטיים של האחים וורנר, א.ע.), כאשר חיפש קיצור דרך לעיר בורבנק, התרסק
          לחופה של אפריקה, ואז, מניף את מקל ההליכה שלו, שבהמשך ימיר לאחוז נאה של
          שותפות במניות, קרא למקום קזבלנקה.
        </p>
        <p>
          אני פשוט לא מבין את הנקודה שלכם. אפילו אם הייתם מתכננים לשווק מחדש את
          הסרט, אני בטוח כי הצופה הממוצע יוכל ללמוד להבדיל בין אינגריד ברגמן
          והרפו (אחד האחים מרקס, א.ע.). אני לא בטוח שאני אוכל לבצע זאת, אבל ללא
          ספק אשמח לנסות.
        </p>
        <p>
          אתם טוענים כי אתם הבעלים של קבזלנקה ואף אחד אחר לא יכול להשתמש בשם זה
          ללא רשותכם המפורשת. מה בנוגע לאחים וורנר? מקצועית, אנחנו היינו אחים
          הרבה לפניכם. כאשר הויטפון (מכשיר להקלטת סרטים שפותח על ידי האחים
          וורנר. א.ע.) עדיין היה זיק בעיני הממציא, אנו היינו בסבב הופעות תחת
          הכינוי "האחים מרקס" ואפילו לפנינו, היו אחים אחרים – האחים סמית'; האחים
          קרמאזוב; האחים דן, שחקני בייסבול בדטרויט; ו"אחי, יש לך שקלי?" שהיה
          במקור "אחים, יש לכם שקל", אך הם בזבזו את כל הכסף (באנגלית משחק מלים,
          גם "צמצו את המרחב") כך שהם נאלצו לזרוק החוצה אח אחד, נתנו את כל הכסף
          (או המרחב) לאח האחר וצמצמו את המשפט ל"אחי, יש לך שקל?"
        </p>
        <p>
          הצעיר באחים וורנר קורא לעצמו ג'ק. האם גם הוא טוען כך? זהו לא שם מקורי
          – הוא היה בשימוש הרבה לפני הולדתו. אני יכול לחשוב על שתי ג'קים כלאחר
          יד – היה ג'ק ב"ג'ק ואפון הפלא". וג'ק המרטש, שחתך לעצמו מקום בדפי
          ההיסטוריה. בנוגע להארי, האח הבכור, הוא ודאי חותם על הצ'קים בביטחון מלא
          כי הוא ההארי הראשון בכל הזמנים וכל שאר ה"הארי" הם מתחזים. כלאחר יד,
          אני יכול לחשוב על שני הארי שקדמו לו. היה את הנרי "הפרש הקל" שהתפרסם
          בימי המהפכה ואת הארי אפלבוים שחי בקצה רחוב 93 בשדרות לקסינגטון.
          אפלבוים לא היה ידוע היטב – כמעט שכחתי איך הוא נראה ובפעם האחרונה
          ששמעתי עליו הוא מכר עניבות בחנות "ובר והיילברונר"; אבל לעולם לא אשכח
          את אמו שהכינה את שטרודל התפוחים הטוב ביותר ביורקוויל.
        </p>
        <p>
          כעת הגענו לסטודיו בורבנק, זהו השם שהאחים וורנר העניקו לשטחם. בורבנק
          הזקן כבר איננו, אולי אתם זוכרים אותו – הוא היה אדם יוצא דופן בגן הירק.
          הוא היה קוסם שערבב את כל הירקות והפירות והותיר את הצמחים המסכנים כה
          מבולבלים ועצבניים עד כי הם לא ידעו אם מטרתם היא לתבל את הבשר או להגיע
          כקינוח.
        </p>
        <p>
          זוהי השערה, כמובן, אך מי יודע – ייתכן כי שרידי משפחת בורבנק לא שמחים
          במיוחד בנוגע לעובדה כי צמח המניב סרטים התמקם בעירם, אימץ את השם
          "בורבנק" והשתמש בו בפתיחת סרטיו. ייתכן אפילו כי משפחת בורבנק גאים יותר
          בתפוחי האדמה של הזקן שלהם מאשר בתוצרי העיר המאוחרים כגון "קזבלנקה" או
          אפילו "כורי הזהב של 1931".
        </p>
        <p>
          המכתב כולו נראה מריר במקצת, אך אינני מתכוון לכך. אני אוהב את וורנר –
          כמה מחברי הטובים ביותר הם האחים וורנר. ייתכן אפילו שאני עושה להם עוול
          והם אינם יודעים על מקרה זה. למעשה, לא יפתיע אותי כלל לגלות כי ראשי
          המחלקה המשפטית של האחים וורנר לא יודעים דבר על תביעה זו, מכיוון שאני
          מכיר רבים מהם והם אנשים נהדרים בעלי שיער שחור גלי, חליפת שני חלקים
          ורוחשי חיבה לעמיתם "ד"ר גילספי" (עו"ד גיבור סדרת טלוויזיה משנות ה40). יש לי
          תחושה כי ניסיון זה למנוע מאיתנו שימוש בכותרת הנ"ל הוא מזימה של איזה
          שיכור אדום פנים המשמש כמתמחה במחלקה המשפטית שלהם. אני מכיר אנשים מסוגו
          – רק יצא מבית הספר למשפטים, רעב להצלחה ושאפתני מכדי לעקוב אחרי החוק
          הטבעי של הקידום. אותו פרקליט מרושע ודאי דחק בעורכי הדין של האחים
          וורנר, אשר רובם אנשים נהדרים בעלי שיער שחור גלי, חליפת שני חלקים וכו',
          במטרה להציק לנו.
        </p>
        <p>
          ובכן, לא ניתן לכך לעבור בשתיקה! אנו נילחם בו עד לבית המשפט העליון! לא
          ניתן להרפתקן משפטי עגום פנים ליצור דם רע בין הוורנרים והמרקסים. כולנו
          אחים עד לשד עצמותינו ונשאר חברים עד אשר הסליל האחרון של "לילה
          בקזבלנקה" ינשור מהמקרן.
        </p>
        <p>גראוצ'ו מרקס</p>
      </div>
      <img
        src={Marx_Brothers_1948}
        className="articleImg"
        alt="האחים מרקס ב1948"
      />
    </div>
  );
}

export default MarxBros;
