import { Typography } from "@material-ui/core";
import "./Articles.scss";

function Articles(): JSX.Element {
  return (
    <div className="Articles">
      <Typography align="center" display="block" variant="h2">
        גלישה בסתר \ גלישה פרטית (incognito)
      </Typography>
      <p>
        לפני כמה שנים הציגה גוגל מצב חדש "גלישה בסתר" ושאר הדפדפנים סגרו את הפער
        די מהר והציגו מצב דומה משלהם . המצב, בניגוד לדפדפן הרגיל, לא שומר
        היסטורית גלישה ועוגיות. כדי להבין את משמעות הדבר נסביר מה הן עוגיות:
      </p>
      <p>
        העוגיות הן פיסות מידע קטנות שמועברות מהאתר בו אתם גולשים לדפדפן שלכם
        ונשמרות על המחשב. בכל פעם שאתם גולשים לאתר המחשב "מזכיר" לאתר את המידע
        שהוא שמר שם בפעם הקודמת וכך ניתן להמשיך לגלוש מהנקודה בה עצרתם. העוגיות
        משמשות גם בגלישה הנוכחית (עגלת קניות היא הדוגמא הקלאסית וגם הסיבה
        שהומצאו. המידע על מה בחרתם לקנות נמצא במחשב ונשלח מחדש לאתר בכל סיבוב)
        וגם נשארות על המחשב עד לגלישה הבאה (חשבון שמור הוא הדוגמא הרגילה למצב
        זה, לדוגמא: העוגיות שומרות את פרטי הכניסה שלכם לפייסבוק ואתם לא צריכים
        להקליד את הסיסמא מחדש בכל פעם). לעוגיות יש תאריך תפוגה (שנקבע לכל עוגיה
        בנפרד, עם זמן מקסימום שמשתנה בין דפדפן לדפדפן) ולאחריו הן נמחקות.
      </p>
      <p>
        במצב גלישה בסתר הדפדפן שומר את העוגיות בצורה זמנית בלבד, כלומר תאריך
        התפוגה של העוגיות הוא בסוף הגלישה הנוכחית. ברגע שאתם סוגרים את הדפדפן
        העוגיות וההיסטוריה נמחקות, כך שמי שמגיע אחריכם למחשב לא יכול לראות מה
        עשיתם או להיכנס לחשבון שהייתם רשומים בו , להמשיך את הקניות שעשיתם או כל
        דוגמא אחרת. זה יעיל במיוחד כשאתם גולשים ממחשב שהוא לא שלכם ודואג שלא
        תשכחו לצאת מהחשבון שלכם.
      </p>
      <p>
        אז מה המצב לא עושה? הוא לא מונע מספק האינטרנט לדעת לאן גלשתם. הוא לא מגן
        עליכם מוירוסים וגם לא מונע מתוכנות חיצוניות לעקוב אחריכם, כך שהוא לא מגן
        עליכם ברשת ציבורית, שהיא באופן כללי מאוד לא בטוחה . בנוסף יש דרך קלה
        לגלות את ההיסטוריה למרות המצב – להתקין תוכנה ששומרת את ההיסטוריה עליה.
        דפדפן לא ימחק את מידע התוכנה בסוף הגלישה (אין לו גישה לכך) וככה תוכלו
        לראות את ההיסטוריה, אך לצורך זה יש להתקין את התוכנה לפני הגלישה ולא
        אחריה.
      </p>
    </div>
  );
}

export default Articles;
