function DeezerSpotify(): JSX.Element {
  
  return (
    <div className="Article">
      <h2>מסקנות – Deezer vs Spotify</h2>
      <div className="articleBody">
        <p>
          הקדמה – עם האוזניות החדשות שקניתי (סוני) הגיעה גם תקופת ניסיון של
          ארבעה חודשים בדיזר (פרימיום 360) והחלטתי לתת להם צ'אנס, כי אם כבר אז
          למה לא. מסקנות מהיתרונות והחסרונות של כל אחד מהשירותים.
        </p>
        <br />
        <p>1 – המעבר עצמו.</p>
        <p>
          אני מושקע כבר יותר מ4 שנים של יצירת פלייליסטים בספוטיפיי וחבל לאבד
          הכל, כ"כ להעביר ידנית עשרות אלפי שירים זה כאב ראש רציני. סה"כ המעבר
          היום בין שירותי מוזיקה הוא די חלק, חוץ כמובן מספוטיפיי שמגבילים חוקית
          יצוא של פלייליסטים שנכתבו אצלם (ויוצאים בני עוולה). בסוף מצאתי סקריפט
          בפייתון שמייצא את כל השירים מהספוטיפיי לקובץ טקסט לפי רשימות ההשמעה
          ואחרי כמה התאמות שלי הצלחתי להכניס אותן לדיזר דרך סקריפט אחר שיודע
          לקרוא מקובץ טקסט. ניתן לביצוע אבל דורש ידע מסוים, כל שירות שאינו
          ספוטיפיי יתן לכם פשוט לייצא הכל אוטומטית.
        </p>
        <p>2 – איכות</p>
        <p>
          רשמית האיכות בדיזר טובה יותר, בתנאי שאתה במנוי היקר (קיים flac בלא מעט
          שירים). הייתי כאן די סקפטי כי הנחתי שאני לא אבדיל והאיכות בספוטיפיי
          מספיק טובה, אבל מה אני יודע. מסתבר שכשאני עם האוזניות אני דווקא כן
          מבדיל ושומע את האיכות הטובה יותר, מאומת בבדיקה עיוורת. ברמקולים שלי
          אני לא שומע הבדל וגם לא שם לב כשאני עובד תוך כדי, אבל כשמחפשים את זה
          זה שם.
        </p>
        <p>3 – מלאי שירים</p>
        <p>
          סה"כ בשניהם יש מספיק ולא הרגשתי בהבדל משמעותי. הם לא טובים לשירים
          נדירים, אבל גם לא היו חסרים לי שירים בולטים באף אחד.
        </p>
        <p>4 – פלייליסטים אוטומטיים</p>
        <p>
          קריטי מבחינתי והדרך העיקרית בה אני מקשיב לשירים. בשניהם קיימים
          פלייליסטים מותאים במיוחד שמתחלפים. מלבדם בדיזר קיימות שתי אופציות –
          מיקס שמבוסס על שיר/אומן ויתן לך מגוון רחב של שירים שיש מצב שאתה אוהב
          או להתחיל משיר/אומן ולתת לו להמשיך לבד, מה שיתן שירים כמה שיותר דומים
          לשיר הראשון. בספוטיפיי שתי המצבים יתנו מצב שזהה לראשון. סה"כ היתרון של
          דיזר הוא שהוא מאפשר לציין על שיר שאתה לא אוהב אותו ב*כל* פלייליסט,
          אופציה שספוטיפיי צמצמו מאוד לפני כמה שנים, מסיבה לא ברורה. שינוי
          מרענן. חוץ מזה אין הבדל משמעותי.
        </p>
        <p>5 – ממשק</p>
        <p>
          מאוד דומה בשניהם, עניין של נוחות אישית. בדיזר יש מילים לאחוז גבוה מאוד
          מהשירים, בספוטיפיי מדובר בתכונה נדירה וחבל.
        </p>
        <p>6 – קהילה</p>
        <p>
          לקהילה בדיזר יש את תחושת החתרנות של "אנחנו הקטנים שנלחמים במונופול"
          וקהילות כאלו תמיד חמודות יותר, אבל שתי הקהילות פעילות מאוד וגדולות
          מספיק כדי לענות מהר על כל שאלה שצצה.
        </p>
        <p>7 – מחיר</p>
        <p>
          המנוי שאני נמצא בו כרגע הוא מנוי עם שירים באיכות גבוהה במיוחד והוא
          במחיר של מנוי משפחתי (30 ש"ח לחודש). חוץ מזה נראה שמדובר באותם מחירים
          (20 ליחיד, 30 ל6).
        </p>
        <br />
        <p>
          מסקנה – בסופו של דבר מדובר בשירותים כמעט זהים ונחמד לי הגיוון. האם אני
          אשאר בדיזר בעוד 3 חודשים, כשייגמר לי החינמי? יש מצב טוב שכן, עוד לא
          החלטתי.
        </p>
      </div>
    </div>
  );
}

export default DeezerSpotify;
