import DisneySongs3Table from "./DisneySongs3Table.jpg";

function DisneySongs3(): JSX.Element {
  return (
    <div className="Article">
      <h2>שירי דיסני – שיר הנבל [1]</h2>
      <div className="articleBody">
        <p>מה משותף לג'אפר, האדס (בגרסת דיסני) ושאן יו (הנבל במולאן) ? </p>
        <p>
          הם חסרי אישיות כמעט לחלוטין, הם רוצים שלטון!! והם נורא רעים!! והם גם
          לא שרים. שיר הנבל הוא החלק הכי קשה לביצוע מוצלח במחזה ברודווי. הרצון
          של הדמות הראשית הוא החלק שבד"כ מניע את הסיפור, הרצון של הנבל הוא
          המכשול וככל שהנבל מוצלח יותר המכשול מעניין יותר ולפיכך הסיפור כולו
          מעניין יותר. כחלק מהגדרות התבנית דמויות שרות כדי להביע את רצונותיהם
          וכשדמות לא מסוגלת לשיר, כנראה שחסר לה משהו באישיות [2].
        </p>
        <p>
          נבל מוצלח במיוחד לא ישיר רק את השיר שלו, אלא יהיה חלק בלתי נפרד מעלילת
          הסרט. הדמות הבולטת ביותר בעניין הזה היא פרולו (הגיבן מנוטרה דאם) – הוא
          שר חלק משיר הפתיחה, מלווה את הגיבור בשירו והשיר שלו מהווה חצי משיר
          הנושא של הסרט. ואכן פרולו הוא בקלות הנבל הכי מוצלח של דיסני. במקום
          להיות סתם רע שרוצה כח, הוא דמות מוטרדת שרק רוצה לעשות טוב ולהועיל
          להמון העם הטיפשים ולהגן עליהם מעצמם. כשפרולו מתאהב הוא מבין שמדובר
          במשהו רע, אבל לא מצליח לעצור את עצמו וביאושו מאשים את כל העולם
          ומשתגע[3].
        </p>
        <p>
          דמות נוספת שמככבת לא מעט בסרט בו היא מופיעה היא סקאר (מלך האריות) שגם
          הוא הרבה יותר מסתם נבל. הוא האח החכם יותר, אך הצעיר והחלש שמרגיש שקופח
          בגלל סדר הירושה, לאחר תיסכול של שנים הוא כורת ברית עם אויבי הממלכה כדי
          לקחת את הכתר לעצמו, בהחלט סיפור סביר שקרה לא מעט בהיסטוריה בלא מעט
          מקומות [4].
        </p>
        <p>
          בשאר השירים הנבלים מציגים את עצמם מצוין ואשאיר לכם לחפש במקור ולבנות
          את התיאוריות שלכם. בשורה אחת אפשר לראות שגסטון (היפה והחיה) מופיע גם
          הוא בשיר הפתיחה אבל מהווה רק חצי מהבעיה בסרט. אורסולה (בת הים הקטנה)
          היא דמות של אישה שאמורה להיות מאוד גברית (הם אפילו הביאו דראג קווין
          לאולפן כדי לצייר את התנועות שלה) [5] ולורד רטקליף (פוקהונטס) הוא הבחור
          האומלל שתמיד היה הדמות השנואה ומחפש דרך לזכות בלב של כולם בעזרת המון
          כסף.
        </p>
      </div>
      <img src={DisneySongs3Table} className="articleImg" />
      <ul className="articleReferences">
        <li> [הכנס כאן תמונת אילוסטרציה של נֵבֶל]</li>
        <li>
          יש יוצאי דופן לכלל הזה, וסיבה נוספת ששאן יו לא מקבל שיר היא עובדת
          היותו הרבה יותר אפל מהסטדנרט של דיסני. שיר מבחינתו פשוט יהיה יציאה
          מהדמות. אבל שימו לב שדיסני לא הצליחו למצוא תחליף לשיר ושאן יו אכן חסר
          אישיות.
        </li>
        <li>
          "It's not my fault; If in God's plan; He made the devil so much;
          Stronger than a man". מי שמתעניין כדאי לקרוא את השיר כולו שמביע את
          העניין בצורה מעולה.
        </li>
        <li>"אבל זה בכלל שייקספיר~&@!!!!"</li>
        <li>
          אלן מנקן אומר את זה במפורש בריאיון. זה מהתקופה שעוד היה מותר לשים
          דמויות כאלו בתור רעים.
        </li>
      </ul>
    </div>
  );
}

export default DisneySongs3;
