function NetCencor(): JSX.Element {
  return (
    <div className="Article">
      <h2>סיכוני אבטחה בסינון אינטרנט</h2>
      <div className="articleBody">
        <p>"שרשרת נבחנת בנקודה החלשה ביותר" פתגם עממי.</p>
        <p>
          בשנים האחרונות נפוצות (בעיקר בציבור הדתי) תוכנות לסינון גלישה
          באינטרנט, שמטרתן, ובכן, היא לסנן את תכני האינטרנט הבעיתיים. מפורנו ועד
          פורומים לגידול עציצים, בהתאם לבקשת המשתמש. את התוכנות אפשר לסווג לשתי
          שיטות עיקריות:
        </p>
        <p>
          1. סינון DNS. בשיטה זו משתמשים הסינונים המובנים מבית היצרניות. השיטה
          הזו פשוטה מאוד – בכל פעם שאתם מקלידים כתובת של אתר בשורת הכתובת, במקום
          להפנות אתכם לדף המבוקש אתם מופנים לאתר אחר, נניח לאתר שהטקסט בו הוא
          "הדף חסום" [1] . היתרון בשיטה הוא הפשטות והעובדה שאין בה פרצות בטיחות,
          החיסרון היא שהיא מאוד קלה לעקיפה. החלפת הDNS היא פעולה פשוטה שתיקח
          פחות מדקה גם לאנשים שלא מבינים בטכנולוגיה (חפשו בגוגל אפילו בעברית:
          "החלפת DNS") והיא תבטל את החסימה לחלוטין.
        </p>
        <p>
          2. ניתוב הגלישה. הבולטת ביותר בשיטה זו בישראל היא נטספארק (שאינטרנט
          רימון משתמשים בשירותיה, או לפחות השתמשו), זו גם השיטה בה משתמשות
          מדינות שמצנזרות את האינטרנט (סין/רוסיה וכו').
        </p>
        <p>
          פה הסינון הרבה יותר קפדני – כל הגלישה של המחשב עוברת דרך שרת אחר [2],
          על השרת מותקנת תוכנה כלשהי שקובעת מה יסונן ולמחשב בנקודת הקצה מועברת
          רק הגלישה המסוננת. השיטה הזו הרבה יותר מורכבת, כי צריך להחזיק שרתים
          פעילים שיוכלו להעביר את כל תעבורת האינטרנט של המשתמשים דרכם. היתרון
          בשיטה הוא היעילות של החסימה – הרבה יותר קשה לעקוף אותה (למרות שאפשר)
          ואפשר גם לחסום תכנים בתוך דפים ספציפיים.
        </p>
        <p>
          לשיטה הזו יש כמה חסרונות בולטים. החסרון הגדול ביותר, ממנו נובעים כל
          החסרונות האחרים, הוא בטיחות. בשיטה הזו למסנן של האינטרנט יש גישה לכל
          מה שעובר באינטרנט. בעולם בו רובנו ניגשים לבנק, דואר ועשרות רבות של
          אתרים קריטיים נוספים מדובר בפרצת אבטחה רצינית.
        </p>
        <p>
          לא מספיק שאתם סומכים על מפעילי תוכנת הסינון, אתם גם צריכים לסמוך עליהם
          שהאבטחה שלהם הדוקה מספיק. ברגע שהוספתם עוד חוליה לשרשרת החלשתם אותה,
          יתכן הרי שיש להם פרצה הם לא יודעים על קיומה.
        </p>
        <p>
          מהסיבה הזו (ומהסיבה שממשלות משתמשות בשיטה זו כדי לפגוע בחופש הביטוי.
          וגם כמה סיבות נוספות) ענקיות האינטרנט נלחמות בשימוש זה ומקשות על
          תעבורה אליהן, מה שיוצר משחק חתול ועכבר תמידי בין תוכנות הסינון שרוצות
          להשתמש בגוגל ופייסבוק ובין גוגל ופייסבוק שלא רוצות שהן ישתמשו בהן.
        </p>
      </div>
      <ul className="articleReferences">
        <li>פישטתי פה ולא הסברתי מהו DNS, מוזמנים לחפש בגוגל.</li>
        <li>דרך VPN לחובבי הטרמינולוגיה הטכנית.</li>
      </ul>
    </div>
  );
}

export default NetCencor;
