// import allArticles from "../AllArticles";

function SofðuUnga(): JSX.Element {
    return (
        <div className="Article">
            <h2>sofðu unga ástin mín</h2>
            <div className="articleBody">
                <p>
                    לפני שאתם מתחילים לקרוא תלחצו פליי על הסרטון למטה ושימו את השיר ברקע,
                    ליצירת האווירה המתאימה.
                </p>
                <p>
                    היה היה פעם זוג איסלנדים שחיו להם בשקט באיסלנד, לגבר קראו
                    אייבנדור-מן-ההר (Fjalla-Eyvindur) ולאישה קראו הלה (Halla).
                </p>
                <p>
                    אייבנדור שימש כרועה צאן שכיר והחיים התנהלו על מי מנוחות, אך יום אחד
                    קרה הנורא מכל - אייבנדיר רצח את הממונה עליו ונדון לגלות, דבר שבאי
                    האיסלנדי פירושו מוות בשממה ובקור.
                </p>
                <p>
                    הלה נצבה עתה מול ברירה נוראית. היא יכלה ליטוש את אהובה ולהמשיך לחיות
                    כחלק מהחברה באי, או לצאת לגלות עם אייבנדיר ולנדוד איתו בחורף הארקטי עד
                    הסוף הבלתי נמנע. הלה בחרה את הבחירה הקלאסית (במידה ואתה דיסני) ונשארה
                    עם אהובה וכפי שקורה במקרים האלה לזוג נולד ילד.
                </p>
                <p>
                    לילד, כמובן, לא היה שום סיכוי לשרוד בנדודים של הוריו באי, והלה נאלצה
                    לראות את תינוקה גווע לאט בידיה. לכן, בעודה שרה לתינוק שיר ערש על מנת
                    שיישן, זרקה הלה את התינוק מעבר לצוק.
                </p>
                <p>
                    שיר הערש הזה מתאר את השיר ששרה הלה לתינוק והוא שיר הערש האיסלנדי המוכר
                    ביותר (וגם זה שגרם לי ללמוד איסלנדית בסיסית). תרגום שם השיר הוא "שן בני, נומה ילד קט".
                    <br />כי הם מטורפים האיסלנדים
                    האלו.
                </p>
                <iframe style={{ maxHeight: "400px" }}
                    width="893"
                    height="710"
                    src="https://www.youtube.com/embed/_DoyDHqakxQ"
                    title="YouTube video player"
                    allow="accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
                ></iframe>
            </div>
        </div>
    );
}

export default SofðuUnga;
