// import allArticles from "../AllArticles";

function Antivirus(): JSX.Element {
    return (
        <div className="Article">
            <h2>בטיחות ברשת – אנטיוירוס</h2>
            <div className="articleBody">
                <p>
                הגנה על מחשבנו האישי הוא נושא חשוב מאין כמותו, שאפשר להתמודד איתו בצורה לא רעה עם קצת הגיון בריא ותוכנה או שתיים, אך עדיין רבים נופלים בו. הסדרה תתחיל מהצורך מתוכנות הגנה ותעבור להסברים כלליים על בטיחות ברשת ואיך לגלוש נכון.
                </p>
                <p>
                פרק ראשון: הצורך באנטי־וירוס על מחשבכם.
                </p>
                <p>
                נתחיל מהסוף: אנטי־וירוס הן תוכנות גרועות. ממש. הן נוטות לא לחסום־וירוסים באחוזים די גבוהים וגם לחסום לא מעט תוכנות לגיטימיות מכיוון שאופן הפעולה שלהן עלול להיות דומה לוירוסים [1]. בנוסף, פעמים רבות תוכנות האנטי־וירוס מנסות להתקין על מחשבכם תוסף לדפדפן, דפדפן שלם [2] או סתם להציק עם פרסומות והאטה של המחשב.
                </p>
                <p>
                אבל איכשהו להתגונן צריך הרי מכמויות הוירוסים שמסתובבת היום; בדיוק מסיבה זו מייקרוסופט הוציאה אנטי־וירוס משלה שמגיע מותקן על המחשב שלכם (בהנחה שאתם מריצים וינדוס 8 או 10). האנטי־וירוס המובנה הנ"ל [3] התחיל אמנם ממש גרוע, אבל בשנים האחרונות סגר יפה את הפער וכיום הוא מגיע במבחני ביצועים לאחוזים דומים לאלו של חברות שמתמחות בהגנה מפני־וירוסים. מסיבות אלו, למשתמש הממוצע עדיף להסתפק בהגנה המובנית, בטח ביחס לאנטי־וירוס חינמי אחר. פעמים רבות הגרסה בתשלום מסוגלת לבצע דברים נוספים, מי שמרבה להסתבך ברשת יכול לשקול לשלם את התשלום החודשי (זה לא זול) וליהנות מהגנה יעילה מעט יותר (אך לא הרבה יותר).
                </p>
                <p>
                בנוסף, תוכנה נוספת שקיימת להגנה על מחשבכם היא Malware protection. למרות ההתיימרות של החברות המייצרות לטעון שהתוכנה מסוגלת להגן על מחשבכם האישי, היא לא. מה שהיא כן עושה בהצלחה הוא להגן עליכם במהלך גלישה ברשת מפני מגוון תוכנות זדוניות שמסתובבות שם בחוץ. מרוב התוכנות הבעייתיות ברשת ניתן להתגונן בעזרת הגיון בריא והבנה בסיסית במנגנוני הגנה (הרחבה בפוסטים הבאים), אבל אם אתם מסתובבים הרבה באתרים מפוקפקים [4] מומלץ לשקול לשלם 40$ לשנה בנוסף להגנה שמציעה מייקרוסופט, במקום לשלם את המחיר הגבוה יותר לאנטי־וירוס מסורתי (יש גם הגנה חינמית, אבל היא לא משהו).
                </p>
            </div>
            {/* <img src={TangledPic} className="articleImg"/> */}
            <ul className="articleReferences">
                <li>האחוזים המדויקים של חסימות שווא ופספוס חסימות מוצדקות משתנה בהתאם לתוכנה הספציפית וצורת העבודה, לכן לא הבאתי פה אחוזים. אם אתם רוצים אפשר לחפש בדיקות באינטרנט.</li>
                <li>הגדילו לעשות avast שמתקינים לכם בכח דפדפן שהם טוענים כי הוא בטוח יותר מהמובנה שלכם, בעוד למעשה יש בו יותר פרצות אבטחה.</li>
                <li>אם ממש חשוב לכם שמות – windows defender security center</li>
                <li>לדוגמא אתרי הורדות לא חוקיות, צפיה ישירה, אתר שיתוף סרטים שאינו מוכר וכו'. כאמור, הרחבה בפוסטים הבאים.</li>
            </ul>
        </div>
    );
}

export default Antivirus;
