import DisneySongs4Table from "./DisneySongs4Table.jpg";

function DisneySongs4(): JSX.Element {
  return (
    <div className="Article">
      <h2>שירי דיסני – שירי המהפך והנושא</h2>
      <div className="articleBody">
        <p>
          מתי מגיע שיא הסיפור? רוב חובבי התרבות המודרנית יגידו שבסוף הסיפור,
          הסיפור הולך ונבנה וההתרה תגיע לקראת הסוף הטוב, אבל כמו שיודע כל מי
          שישב מיואש במגילת אסתר וחיכה שהרעש הזה יגמר רק כדי לגלות שהקטע שבו
          הורגים את המן מגיע באמצע, זה לא תמיד המקרה. שיא הסיפור יכול בלא מעט
          מקרים להגיע באמצע, מה שיוצר צורך בבעיה נוספת או התרה ארוכה של הבעיה,
          שתמלא את הסיפור עד הסוף [1].
        </p>
        <p>
          בסרטי דיסני בדרך כלל יש לנו שתי בעיות, שבפתיחת הסרט לא לא קשורות
          ישירות זו בזו. הבעיה הראשונה מתוארת בשיר רצון הגיבור ומגיעה מצד הגיבור
          והבעיה השניה מגיעה מצד הנבל ומתוארת בשיר הנבל. הבעיות אמורות להתחבר
          בהמשך הסיפור, בחלק מהסרטים בצורה אלגנטית (בת הים הקטנה, מלך האריות)
          ובחלק מהסרטים בצורה מאולצת מאוד (אלאדין, הרקולס). באופן קבוע הבעיה
          שקשורה לגיבור תיפתר כבר באמצע הסיפור והבעיה שקשורה לנבל תיפתר בסוף
          (בעזרת זה שהרוע הטמון בנבל יגרום לו להרוג את עצמו. הסרט היחיד ברשימה
          בו הגיבורים הורגים אקטיבית את הנבל(ית) הוא בת הים הקטנה [2]).
        </p>
        <p>
          אז כמו שכבר ניחשתם, הבעיה של הגיבור נפתרת בשיר. את השירים שפותרים את
          הבעיה חילקתי לשנים, לאחד קראתי "שיר המהפך" ולשני "שיר הנושא". השירים
          שסיווגתי תחת המהפך מתאפיינים ברוב המקרים בתבנית קבועה. בתחילת השיר
          הגיבורים במצב פיזי או נפשי אחד, אותו נראה בתחילת השיר ועם התקדמות השיר
          המצב של גיבורינו ישתנה ונראה אותם שרים מהמצב החדש. שיר הנושא הוא השיר
          שפותר או מתאר את הבעיה העיקרית בסרט והוא בדרך כלל יהיה השיר המושקע
          ביותר מוזיקלית, אפשר לזהות אותו לפי השיר שמבוצע עם הכתוביות על ידי זמר
          פופ מצליח (שימו לב שבשני הסרטים בהם חסר שיר כזה שיר הגיבור יהיה השיר
          שיבוצע בסוף) . אפשר לראות מהטבלה שהשירים יחסית מקבילים וכשיש אחד הוא
          יבוא על חשבון השני.
        </p>
        <p>
          עכשיו נשאר לנו לשאול – איזו משתי הבעיות שפירטנו עליהן חשובה יותר
          לעלילה? על השאלה הזו מנסות לענות השורות האלו בטבלה. כלל העל הוא
          שהימצאותו של שיר הנושא מעידה שהבעיה העיקרית היא מצד הגיבור והחלפתו
          בשיר המהפך מעידה שהבעיה העיקרית היא מצד הנבל, אבל יש פה יותר יוצאים
          מהכלל מאשר סרטים שנצמדים אליו ולכן נחרוג כאן ממנהגנו ונעבור סרט סרט
          במקום לתת כללים.
        </p>
        <p>
          בת הים הקטנה – בסרט הזה הבעיות משולבות בצורה טובה יותר מבכל סרט אחר.
          הגיבורה רוצה לעלות ליבשה ולהתחתן עם הנסיך והנבל [3]רוצה לשלוט, אבל
          הבעיות משתלבות בצורה כה הדוקה שההתרה חייבת לבוא ביחד. הסרט הזה מקבל את
          שני השירים בלי לפתור כלום, כדי לשמור את ההתרה המשולבת לסוף (וגם כי
          בסרטים הראשונים דיסני עוד היו בקטע של מלא שירים).
        </p>
        <p>
          היפה והחיה – הבעיה העיקרית בסרט באופן בולט היא החיבור בין היפה לחיה
          וזו הסיבה שאליו מתייחס שיר הנושא. השיר פוצל לשניים כי (שוב) דיסני רצו
          עוד כמה שירים, אבל מבחינה עלילתית מדובר בשיר אחד.
        </p>
        <p>
          אלאדין – גם פה הבעיה העיקרית היא מצד הגיבורים ולכן גם פה השיר שלנו יגע
          בהם. זה המקרה הקלאסי ביותר.
        </p>
        <p>
          מלך האריות – מציג מקרה מעניין של גיבור אקטיבי שיצטרך להתגבר על הבעיות
          הפנימיות כדי שיוכל לפתור את בעית הנבל (בכל שאר הרשימה הגיבור פסיבי
          והנבל אקטיבי ביחס ביניהם). השיר גורם לגיבור לצאת למסע בעקבות בעיית
          הנבל.
        </p>
        <p>
          הגיבן מנוטרה דאם – המקרה היחיד שבו הנבל משתתף בעצמו בשיר הנושא, כמו
          שכבר הסברנו. השיר הזה יוצא דופן מאחר והוא לא מהווה התרה לבעיות שנוצרו
          עד עכשיו אלא דווקא מתאר את הסיבוך שלהן.
        </p>
        <p>
          הרקולס – הבעיה העיקרית היא שהרקולס צריך להפוך לגיבור ולכן... רגע, למה
          בעצמם הוא מקבל מהפך במקום שיר נושא? השיר הזה פותר את הבעיה שלו. אבל
          רגע! הוא הוא הופך לגיבור אבל בעצם זה לא נחשב לפי זאוס. נו, לא פלא שזה
          הסרט שהכי פחות הצליח.
        </p>
        <p>
          מולאן – מסע הגיבורה הוא עיקר הסיפור, אבל האיום על סין הוא הבעיה
          הקיומית ולכן נקבל שיר מהפך בו הגיבורה הופכת למה שהיא צריכה להיות כדי
          לפתור את בעיית הנבל, הבעיה העיקרית של הסרט.
        </p>
      </div>
      <img src={DisneySongs4Table} className="articleImg" alt="טבלת החלוקה לשירים של דיסני"/>
      <ul className="articleReferences">
        <li>
          מגילת אסתר היא דוגמה מעולה לתסריט דיסני באופן כללי . במקרה הנוכחי
          הבעיה שיצר המן גדולה יותר ממנו וגם אחרי שהוא מת מגלים שבעצם צריך גם
          להתמודד עם הגזרה ושאר שונאי היהודים. מי מרים את הכפפה?
        </li>
        <li>מולאן חצי</li>
        <li>
          נבלה? נבלית?
          <br />
          עדכון: שאלתי את האקדמיה! נְבָלה
        </li>
      </ul>
    </div>
  );
}

export default DisneySongs4;
