import VideoChatPic from "./VideoChatPic.jpg";

function VideoChat(): JSX.Element {
  return (
    <div className="Article">
      <h2> </h2>
      <div className="articleBody">
        <p>
          מצורפת טבלה קצרה של שמונת התוכנות הפופולריות ביותר לשיחות וידאו, יחד
          עם פירוט קצר על כמה מהן.
        </p>
      <img src={VideoChatPic} alt="טבלת חלוקה לתוכנות וסיכום עם הסבר"/>

        <h5>זום:</h5>
        <p>
          מה משותף לממשלת טאיוואן, גוגל, נאסא, הצבא האוסטרלי, SpaceX, ממשלת הודו
          ורבים אחרים? כולן אסרו על עובדיהן את השימוש בZOOM.
        </p>
        <p>
          התוכנה חוותה זינוק אדיר בפופולריות מתוכנה שאף אחד לא מכיר לשם נרדף
          לשיחות וידאו תוך שבועיים ותודה למרק העטלפים הסיני. נראה שיש שתי סיבות
          עיקריות לשימוש הכל כך נרחב בה:
        </p>
        <p>
          1. היא נוחה לשימוש גם למי שלא מסתדר בכלל עם מחשבים – פשוט תלחץ על
          הקישור.
          <br />
          2. ממש קל להגיד את השם שלה.
        </p>
        <p>
          אבל מהר מאוד התחילו לצוץ בעיות. הסתבר שבחברה מתעלמים מאבטחה, עם שלל
          בעיות שצצו בשנים האחרונות, כולל כמה חמורות ממש שכוללות גישה למחשב של
          המדבר בזום (ולמצלמה ולמיקרופון) ולשיחת הזום עצמה. עוד הסתבר שלציבור לא
          אכפת בכלל מאבטחת מידע ואם תציע מוצר סביר אנשים יקפצו עליו תוך התעלמות
          מהבעיות. הבשורות הטובות? זום הודיעו שעקב הביקורת הציבורית הם עובדים על
          פיתרון ובחודשים הקרובים הדבר היחיד שיעבדו עליו הוא סתימת פרצות אבטחה.
          הם כבר הספיקו לסגור כמה מהברורות ביותר. החדשות הרעות? זה יקח כמה
          חודשים. חוץ מזה בחברה עם היסטוריה כזו של בעיות אבטחה ושרתים שממוקמים
          בסין צריך הרבה אמונה כדי להאמין שמשהו מהותי ישתנה.
        </p>
        <p>
          אז מה לעשות אם אתם חייבים להשתמש בתוכנה בכל זאת? לא הרבה. עד לא מזמן
          היה צורך לשנות את ההגדרות ולוודא שקיימת סיסמה לפגישה, אבל הם שינו את
          ברירת המחדל ומעכשיו אם לא נגעתם התווספה סיסמה. בנוסף ודאו שאתם מורידים
          את התוכנה מהאתר הרשמי של זום, הרצות של התוכנה נגועות בוירוסים מסתובבים
          בכל מקום ברחבי הרשת.
        </p>
        <h5>דיסקורד:</h5>
        <p>
          ב2012 יצרה חברה קטנה שאף אחד לא זוכר את שמה משחק מחשב מרובה משתתפים
          שהיה כישלון חרוץ, אבל בדרך הבינה החברה שאחת הבעיות מהם סבל המשחק היה
          חוסר בתקשורת נוחה בין השחקנים. בדיקה זריזה הראתה שמדובר בבעיה שקיימת
          בכמעט כל המשחקים מרובי המשתתפים הקיימים כיום וכשלוש שנים אח"כ יצאו
          היוצרים המקוריים של המשחק עם יישום חדש – רשת תקשורת שמאפשרת לפתוח
          ערוצים ולדבר בין משתתפים בזמן המשחק. בנוסף הרשת מאפשרת ליצור שרשורי
          שיחה מרובי משתתפים (בדומה לרדיט), לשוחח בשיחת וידאו עם קבוצה קטנה או
          לשדר לקבוצה גדולה. הרשת היתה הצלחה מסחררת מיידית עקב הפרקטיות, נוחות
          השימוש, והעובדה שהרשת לא העמיסה משאבים על המחשב (פרט קריטי לגיימרים
          שמעוניינים בביצועים מיטביים של המשחק).
        </p>
        <p>
          ולעניינו – הרשת מאפשרת פלטפורמה מעולה לשיחות קוליות או וידאו. שיודעת
          לנצל מצוין חיבורי אינרטנט איטיים (קריטי במיוחד במקומות כמו ישראל [1])
          וגם סנכרון עם OBS, דבר מאוד נוח להרצאות לאנשים עם ידע טכני. ניתן לשדר
          לקבוצה שפתחת מראש, לשוחח עם כל חברי הקבוצה בוידאו ולדבר בצ'אט תוך כדי.
          הכל בחינם לחלוטין ובשיחה חוצת פלטפורמות (מחשב, טאבלט, פלאפון וכו').
        </p>
        <p>
          חסרונות בולטים:
          <br />
          אי אפשר להתחבר לשיחה ספציפית, צריך לפתוח חשבון ולהירשם כאיש קשר (או
          להיכנס לערוץ במקרה של שידור). החיסרון מוביל גם לחיסרון הבא – מרבית
          האנשים לא מכירים את התוכנה, מה שאומר שמספיק אדם אחד שמשתתף בשיחה ולא
          מבין באינטרנטים האלו כדי לא לאפשר דיבור בה. החיסרון הבולט הנוסף הוא
          שאין יכולת מובנית לציוד שמעבירי שיעורים צריכים, דברים כמו לוח מחיק או
          שיתוף מסך. את הדברים האלו צריך לעשות דרך OBS, ולמרות שמדובר בכלי הרבה
          יותר עוצמתי מסתם לוח לבן מדובר בכלי שמצריך יכולת טכנית ברמה סבירה.
        </p>
        <p>
          אחרי שהתקנתם את התוכנה אצל כל המשתתפים, לדעתי מדובר בפלטפורמה הכי נוחה
          לשיחות, המאפשרת גם שילחת הודעות נוחה או הרצאה לערוץ. בהצלחה עם זה
        </p>
      </div>
      <ul className="articleReferences">
        <li>
          אין דרך מושלמת למדוד מהירות אינטרנט, אבל לפי הדירוג של אוקלה (הנפוץ
          ביותר) ישראל מתגאה במקום ה37 בעולם במהירות האינרטנט הקווי (בין ברבדוס
          לפנמה) ובמהירות האינרטנט הסלולרי במקום המרשים של 95, אחרי מעצמות
          תקשורת ידועות כמו סוריה, מונגוליה, סנגל, איראן, אנגולה ואחרות.
        </li>
      </ul>
    </div>
  );
}

export default VideoChat;
