import DisneySongsTable from "./DisneySongsTable.jpg";

function DisneySongs1(): JSX.Element {
  return (
    <div className="Article">
      <h2>שירי דיסני – רקע</h2>
      <div className="articleBody">
        <p>
          מפה לשם מצאתי את עצמי עם כמה דברים חשובים, אז מיותר לציין שפתאום הסתבר
          שזה זמן מצוין לעבור על כל סרטי הרנסאנס של דיסני ולמיין את הופעת השירים
          בהם.
        </p>
        <p>
          קצת על הרנסאנס של דיסני: אחרי תקופה מסוימת של כישלונות בשנות השמונים
          דיסני חשבו לוותר על יצירת סרטים מצוירים. לאחר רצף של כמה גלגולים חטיבת
          הסרטים נתנה לאלן מנקן והווארד אשמן יד חופשית ליצור סרט כמו שהם רוצים
          כסוג של ניסיון אחרון. השניים החליטו ליצור סרטים בצורת מחזות ברודווי,
          מחזות עם תבנית שירים קבועה מראש (וגם דרכים לבצע אותם ולהכניס אותם
          לעלילה, אבל זה סיפור אחר ויסופר בפעם אחרת), שעיקרה מוצג בטבלה למטה. יש
          סרטים נוספים של דיסני שעוקבים אחרי חלק מהחלוקה או כולה, אבל כאן נתמקד
          בסרטים העיקריים שעוקבים אחר החלוקה בהצהרה.
        </p>
        <p>
          ברגע שאנחנו רואים את הטבלה מול העיניים, או את מה שאמור היה להיות, הדבר
          הראשון שקופץ לעין הוא החריגות. למה ויתרו על שיר, שמו שני שירים באותה
          עמודה או שמו שיר אחד בשני תפקידים? מי שר את השיר? האם השיר מתאים
          למוטיב העיקרי של הדמות? על כל אלה ועוד לא נספיק לדבר פה, אבל ניגע בהם
          קלות.
        </p>
        <p>
          על החלוקה בטבלה ניתן להתווכח קלות, אבל העיקר די מוסכם. לכל עמודה פה
          מגיעה סדרת פוסטים משלה. אין סיכוי שזה יקרה. ניתן לכל עמודה פוסט אחד
          ונמשיך כמה שיהיה לי כח, בתקוה שנסיים. היום העמודה הראשונה – שיר ההצגה
          \ פתיחה.
        </p>
        <p>
          במקרה הזה השם מסביר היטב מה מטרת השיר – להציג לנו את העולם בו מתרחשת
          העלילה ואת הדמויות הראשיות. שיר פתיחה טוב יכניס אותנו לאווירה בה מתרחש
          הסרט – שירים בסגנון (פסאודו) ערבי וסיני באלדין ומולאן המתרחשים בעולמות
          שונים מאלו של קהל היעד נועדו להקפיץ אותנו במחשבה לשם. צלצולי כנסיות
          ושירים מהקאנון הכנסייתי כשרוצים להכניס את השומעים לאווירה דתית (הגיבן
          מנוטרה דאם) ושירי מלחים (בת הים הקטנה, פוקהונטס) הם דוגמאות טובות
          נוספות להכנסה לאווירה.
        </p>
        <p>
          בנוסף שיר פתיחה טוב יציג לנו את גיבורי ההצגה – שימו לב ליפה והחיה, בה
          שיר ההצגה משמש גם כשיר של הדמות הראשית. בחלקם יוצג לנו גם הנבל הראשי
          ואם יש מספר, השיר תמיד יושר על ידו. כשהסרט מזגזג בין שני עולמות ששניהם
          חשובים לנו באותה מידה, נקבל שני שירי פתיחה (בת הים הקטנה, פוקהונטס).
          השיר הזה הוא קריטי, אנחנו צריכים לדעת את הרקע לסיפור ולכן אין אף סרט
          שדילג עליו. מחר נתחיל בחלקים המעניינים של הטבלה – שיר הדמות הראשית.
        </p>
      </div>
      <img src={DisneySongsTable} className="articleImg" alt="טבלת החלוקה לשירים של דיסני"/>
    </div>
  );
}

export default DisneySongs1;
