import allArticles from "../AllArticles";

function Azerbaijan(): JSX.Element {
  return (
    <div className="Article">
      <h2> </h2>
      <div className="articleBody">
        <p>
          במרבית המדינות בעולם מתקיימות כיום בחירות דמוקרטיות לשלטון. בעוד
          במדינות רבות מדובר בחגיגה לדמוקרטיה, עם שקיפות ותקשורת הוגנת (ולפעמים
          כל כך נהנים מהחגיגה שעושים עוד סיבוב) פעמים רבות עולה חשד לזיופים
          כבדים. ממקרים יחסית קלים, כגון הבחירות האחרונות בארה"ב, ועד מקרים כמו
          הבחירות בצפון קוריאה, שם ברור לכולם שמדובר במס שפתיים.
        </p>
        <p>
          אחת המדינות בה נערכות בחירות היא אזרבייג'אן. המדינה, שהייתה בעבר חלק
          מברית המועצות עברה טלטלות מסוימות לאחר התפרקות האחרונה והתייצבה ב1998,
          עם עליתו לשלטון של היידר אלייב.
        </p>
        <p>
          אלייב שלט במדינה כ15 שנה ובסופן החליט שהגיע הזמן לפרוש. במקומו החליט
          לרוץ לנשיאות בנו, אילהם, כמובן בבחירות חופשיות ודמוקרטיות.
        </p>
        <p>
          כולכם תופתעו בודאי לשמוע שבנו של הנשיא המכהן זכה בניצחון סוחף וללא
          עוררין, אך החלק המדהים באמת הוא שתוצאות הבחירות פורסמו על ידי הממשלה
          האזרית *לפני* הבחירות. כך באפליקציה הרשמית של הממשלה פורסמה יומיים
          לפני הבחירות הידיעה המרגשת על ניצחונו הסוחף של אילהם תוך זכיה ב72.38%
          מקולות הבוחרים.
        </p>
        <p>
          אך אם חששתם שהידיעה תפגע בנשיא לעתיד, אל דאגה; בבחירות עצמן התברר כי
          למעשה 84.5% מאוכלוסיית המדינה תומכת באילהם כנשיא, ונישא על גבי אהדת
          העם הוא שולט שם עד עצם היום הזה.
        </p>
      </div>
    </div>
  );
}

export default Azerbaijan;
