import MarcinPrzybyłowiczPic from "./MarcinPrzybyłowiczPic.jpg";

function MarcinPrzybyłowicz(): JSX.Element {
    return (
        <div className="Article">
            <h2>מצעד המלחינים –  מרצ'ין פשיבילוביץ</h2>
            <div className="articleBody">
                <p>
                נפתח את המצעד שלנו עם המלחין הצעיר ביותר (נולד ב1985). הפולני בעל השם הקליט מצא עבודה מיד אחרי שסיים את התואר בחברת משחקים פולנית נישתית למדי – CD Project Red והלחין להם את המשחק שהצליח בצורה סבירה, The Witcher 2.
                </p>
                <p>
                מאחר שהוא עשה אחלה עבודה, באופן טבעי ניתנה לו גם העבודה על משחק ההמשך The Witcher 3 וכאן התברר שהוא זכה בפיס, כי המשחק הפך לאחד המשחקים המצליחים ביותר אי פעם. מרצ'ין לקח את ההזדמנות בשתי ידיים וכתב את אחד הפסקולים המצליחים ביותר שנכתבו למשחק מחשב (הפסקול כל כך מתאים לעולם של הוויצ'ר שגם מלחין הסדרה הלך בעקבותיו וכתב מוזיקה באותו סגנון [1]).
                </p>
                <p>
                בין לבין הוא הספיק להלחין כמה פסקולים נוספים, בניהם הפסקול לThe Vanishing of Ethan Carter שהצליח מאוד וגם מוזיקה לכמה סדרות טלוויזיה פולניות.
לאחרונה הוא הלחין גם את Cyperpunk 2077, שאני לא יכול להביע עליו דעה כי עוד לא שיחקתי, אבל אי אפשר לא לציין את אחת ההשקות הגדולות בהיסטוריה.
                </p>
                <p>
                סגנון: אפל מאוד. הרבה שימוש בכלי קשת, ממעט יחסית להשתמש בכלי הנשיפה, איטי וחודר.
                </p>
                <p>
                סיפורי צדיקים [2]: הטריילר הוא תמיד אחד הקטעים הבעייתים מבחינת המוזיקה. המוזיקה היא הדבר האחרון שנוצר, אחרי שהסרט\משחק כבר כמעט מוכן והטריילר צריך לצאת כמה חודשים קודם, כשעוד אין עם מה לעבוד. בדרך כלל מה שעושים הוא לדחוף מוזיקה מפרק קודם בסדרה או למצוא איזה שיר מתאים ולהצמיד אותו לטריילר.
                </p>
                <p>
                גם בטריילר של הווויצ'ר 3 זה מה שהיה אמור לקרות. תיכננו לקחת את היצירה  A Hole in the Sunשל Two Steps from Hell ולהדביק אותה לטריילר. מרצ'ין הרגיש שהמוזיקה לא מספיק מתאימה ולכן הצליח לשכנע את החברה לדחות אותו בחודש. בזמן הזה הוא השיג אישור מהלהקה לשנות את השיר שלהם בצורה בה הוא יתאים ולכתוב מוזיקה מקורית לחצי הראשון של הטריילר, שיר שבהמשך יהפוך לאחד מסמלי הסדרה (Lullaby of Woe) [3].
                </p>
                <p>
          <a href="https://he.wikipedia.org/wiki/מרצ'ין_פשיבילוביץ'">לערך הויקי</a>
          <br />
          <br />
          מוזיקה בולטת:
          <br />
          <a href="https://www.youtube.com/watch?v=NknjE2SBPxw">The Fields of Ard Skellig</a>
          <br />
          <a href=" https://www.youtube.com/watch?v=i45SRNKes5Y">
          Ethan's Theme
          </a>
          <br />
          <a href="https://www.youtube.com/watch?v=ohNpf4VnlP8">
          Lullaby of Woe
          </a>
        </p>

            </div>
            <img src={MarcinPrzybyłowiczPic} className="articleImg"/>
            <ul className="articleReferences">
                <li>למרות שהבמאי טרח להדגיש שהם בכלל בכלל לא לפי המשחק. לא פלא שבסוף היא יצאה כמו שהיא יצאה.</li>
                <li>בכל זאת, פולין. אי אפשר בלי.</li>
                <li>וגם מקבל את התואר הנחשק "שיר הערש היחיד שיותר מפחיד משירי ערש איסלנדיים".</li>
                <li>התמונה:  <a href="https://commons.wikimedia.org/w/index.php?curid=85472216">מאת Solika27 - נוצר על ידי מעלה היצירה, CC BY-SA 4.0</a></li>
            </ul>
        </div>
    );
}

export default MarcinPrzybyłowicz;
