
function TrevorMoris(): JSX.Element {
  return (
    <div className="Article">
      <h2>מצעד המלחינים – טרבור מוריס.</h2>
      <div className="articleBody">
        <p>
          הנה אנחנו כבר במלחין השני[1]במצעד המלחינים שלנו, האחד שהכי הופתעתי
          שעוד אין לו דף בויקי, טרבור מוריס.
        </p>
        <p>
          מדובר בסיפור חיים קלאסי על הבחור שלמד מוזיקה בצעירותו, תמיד היה טוב
          בהלחנה ויום אחד לקח את ההימור של לעבור להוליווד ולהתחיל להלחין בחינם
          עד שיציעו לו משהו בתשלום. זה פעל. בשנים האחרונות אנחנו רואים את עליית
          קרנן של סדרות הטלוויזיה וטרבור שלנו, שמתמחה בסדרות טלוויזיה, חי את
          החלום. הוא רשם על שמו הצלחות מסחררות כויקינגים, שושלת טיודור, והבורג'ס
          שהאמת שמוזיקלית לא התלהבתי מהן יותר מדי, אבל עם הצלחה לא מתווכחים.
        </p>
        <p>
          אני גיליתי אותו בפסקול של קסטלווניה, שמאכזבת מבחינת העלילה אך נהנית
          ממוזיקה מצוינת בקטעים שבהם היא מופיעה [2] ובמוזיקת הרקע למשחק Dragon
          Age:Inquisition שאמנם מצוינת, אבל מבוססת בעיקר על המוזיקה של הכותרים
          הקודמים בסדרה (שהולחנו על ידי ינון צור, שללא ספק היה נכנס למצעד אלמלא
          היה סובל מהעובדה שכבר יש עליו ערך).
        </p>
        <p>
          סגנון: מלא תופים, הרבה כלי קשת (אולי קשור לעובדה שהוא כנר ולא פסנתרן
          כמרבית המלחינים). לא ממש ניתן להצביע על סגנון אחיד חוץ מזה, לזכותו
          יאמר שהוא מתאים את עצמו מאוד לסגנון של העולם אליו הוא מלחין.
        </p>
        <p>
          עובדה מעניינת: רוב המלחינים בהוליווד היום מעדיפים להסתפק בהלחנת הסרט,
          אבל מוריס מעדיף גם להתאים בעצמו את המוזיקה שהוא מלחין להופעות חיות וגם
          מנצח אח"כ על התזמורת.
        </p>
        <br />
        <p>
          <a href="https://he.wikipedia.org/wiki/טרבור_מוריס">לערך הויקי</a>
          <br />
          <br />
          מוזיקה בולטת:
          <br />
          <a href="https://www.youtube.com/watch?v=FFWVjdS1Kz4">Vikings</a>
          <br />
          <a href="https://www.youtube.com/watch?v=DFX7v83OTbc">
            Dragon Age:Inquisition
          </a>
          <br />
          <a href="https://www.youtube.com/watch?v=11PZL4sh0Ys">
            olympus has fallen
          </a>
          <br />
          <a href="https://www.youtube.com/watch?v=jYPEmsN1bKo">Castlevania</a>
        </p>
      </div>
      <ul className="articleReferences">
        <li>תראו איך הזמן עובר מהר</li>
        <li>
          חבל שלא היה תקציב לכתיבת יותר מוזיקה, הסדרה סובלת ממיעוט בקטעים
          מולחנים.
        </li>
      </ul>
    </div>
  );
}

export default TrevorMoris;
